tap "borkdude/brew"
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "redis-stack/redis-stack"
brew "ack"
brew "giflib"
brew "jpeg-turbo"
brew "xz"
brew "zstd"
brew "openexr"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "autoconf"
brew "automake"
brew "openssl@3"
brew "bat"
brew "c-ares"
brew "sqlite"
brew "python@3.12"
brew "glib"
brew "xorgproto"
brew "libxcb"
brew "libx11"
brew "harfbuzz"
brew "openjdk"
brew "clojure"
brew "cmatrix"
brew "coreutils"
brew "ctags"
brew "direnv"
brew "docker-completion"
brew "docker"
brew "figlet"
brew "fribidi"
brew "gcc"
brew "gdk-pixbuf"
brew "libnghttp2"
brew "unbound"
brew "gnutls"
brew "libgpg-error"
brew "libksba"
brew "pinentry"
brew "gnupg"
brew "go"
brew "jasper"
brew "netpbm"
brew "pango"
brew "librsvg"
brew "libtool"
brew "graphviz"
brew "hugo"
brew "jq"
brew "lcov"
brew "libomp"
brew "luajit"
brew "msgpack"
brew "ncurses"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "openjdk@17"
brew "pkg-config"
brew "pstree"
brew "python@3.11"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "ruby"
brew "sops"
brew "sqlmap"
brew "telnet"
brew "tokei"
brew "tree"
brew "vim"
brew "zlib"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "borkdude/brew/babashka"
brew "dart-lang/dart/dart", link: false
cask "flutter"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "insomnia"
cask "iterm2"
cask "obsidian"
cask "orbstack"
cask "rectangle"
cask "redis-stack"
cask "redis-stack-redisinsight"
cask "redis-stack-server"
cask "sourcetree"
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "alexisvt.flutter-snippets"
vscode "amiralizadeh9480.flutter-widget-wrap"
vscode "azemoh.one-monokai"
vscode "azemoh.theme-onedark"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "nash.awesome-flutter-snippets"
vscode "pkief.material-icon-theme"
vscode "ryanluker.vscode-coverage-gutters"
vscode "sergelamikhov.lcov-lang"
vscode "streetsidesoftware.code-spell-checker"
vscode "xabikos.javascriptsnippets"
vscode "yinfei.luahelper"
